In [2]:
import pandas as pd
import numpy as np

In [3]:
letters = ["a","b","c","d","e"]
numbers = [10,20,30,40,50]

In [4]:
pd_series1 = pd.Series(numbers)
print(pd_series1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
pd_series2 = pd.Series(letters)
print(pd_series2)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [6]:
pd_series3 = pd.Series(letters,index=numbers)
print(pd_series3)

10    a
20    b
30    c
40    d
50    e
dtype: object

In [7]:
pd_series4 = pd.Series(27)
print(pd_series4)

0    27
dtype: int64

In [8]:
pd_series5 = pd.Series(27,index=[1,2,3,4,5])
print(pd_series5)

1    27
2    27
3    27
4    27
5    27
dtype: int64

In [9]:
dictionary = {"Ahmet":100,"Mustafa":85,"Uğur":105,"Aysun":75}
pd_series6 = pd.Series(dictionary)
print(pd_series6)

Ahmet      100
Mustafa     85
Uğur       105
Aysun       75
dtype: int64

In [15]:
print(pd_series6.ndim) # boyut sayısı
print(pd_series6.dtype) # veri tipi
print(pd_series6.shape) # kaça kaç
print(pd_series6.sum()) # toplam
print(pd_series6.min()) # en küçük değer
print(pd_series6.max()) # en büyük değer
print(pd_series6.mean()) # ortalama

1
int64
(4,)
365
75
105
91.25

In [22]:
pd_series7 = pd.Series([1,2,3,4,5])
print(pd_series7) # listeyi yazdır.
print(np.square(pd_series7)) # kareleri yazdır
print(np.sqrt(pd_series7)) # karekökleri yazdır
print(np.power(pd_series7,4)) # 4. kuvvetlerini yazdır

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     1
1     4
2     9
3    16
4    25
dtype: int64
0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
dtype: float64
0      1
1     16
2     81
3    256
4    625
dtype: int64

In [23]:
opel2020 = pd.Series([145,45,35],["astra","insignia","mokka"])
opel2021 = pd.Series([125,55,55],["astra","insignia","mokka"])

total = opel2020 + opel2021
print(total["astra"])

270

In [24]:
print(opel2020)

astra       145
insignia     45
mokka        35
dtype: int64

In [30]:
from numpy.random import randn

pd_df = pd.DataFrame(randn(3,3),index=["A","B","C"],columns=["Col1","Col2","Col3"])
pd_df

       Col1      Col2      Col3
A  0.269696 -1.211775  1.340391
B  1.114861 -0.534181  2.319593
C -0.212656  1.905034  0.086947

In [31]:
pd_df["Col1"]

A    0.269696
B    1.114861
C   -0.212656
Name: Col1, dtype: float64

In [33]:
pd_df[["Col1","Col3"]]

       Col1      Col3
A  0.269696  1.340391
B  1.114861  2.319593
C -0.212656  0.086947

In [35]:
pd_df.loc["A"]

Col1    0.269696
Col2   -1.211775
Col3    1.340391
Name: A, dtype: float64

In [36]:
pd_df.loc[["A","C"]]

       Col1      Col2      Col3
A  0.269696 -1.211775  1.340391
C -0.212656  1.905034  0.086947

In [37]:
pd_df.loc[[True,False,True]]

       Col1      Col2      Col3
A  0.269696 -1.211775  1.340391
C -0.212656  1.905034  0.086947

In [48]:
pd_df.loc[:,[True,False,True]] # Col1 ve Col3 ü listele.

       Col1      Col3
A  0.269696  1.340391
B  1.114861  2.319593
C -0.212656  0.086947

In [57]:
pd_df.loc[:,:]

       Col1      Col2      Col3
A  0.269696 -1.211775  1.340391
B  1.114861 -0.534181  2.319593
C -0.212656  1.905034  0.086947

In [60]:
pd_df.iloc[0:2,1:3] # 0-1 satırındaki 1-2 kolonlarını göster.

       Col2      Col3
A -1.211775  1.340391
B -0.534181  2.319593

In [62]:
pd_df.iloc[:,[False,True,False]]

       Col2
A -1.211775
B -0.534181
C  1.905034

In [64]:
pd_df.iloc[[True,False,True],[False,True,False]]

       Col2
A -1.211775
C  1.905034

In [65]:
pd_df.iloc[:,[0,2]] # tüm satılardaki 0 ve 2 indislik kolonları listele

       Col1      Col3
A  0.269696  1.340391
B  1.114861  2.319593
C -0.212656  0.086947

In [68]:
pd_df.iloc[:,:2] # tüm satırlar için 0 ve 1 indisli kolonları getir.

       Col1      Col2
A  0.269696 -1.211775
B  1.114861 -0.534181
C -0.212656  1.905034

In [69]:
pd_df.iloc[2,2] # satır indisi:2 sütun indisi 2 olan hücredeki veriyi getir.

0.08694674878301133

In [70]:
pd_df

       Col1      Col2      Col3
A  0.269696 -1.211775  1.340391
B  1.114861 -0.534181  2.319593
C -0.212656  1.905034  0.086947

In [75]:
pd_df.loc[["A","C"],["Col2","Col3"]]

       Col2      Col3
A -1.211775  1.340391
C  1.905034  0.086947

In [76]:
#Veri ekleme
pd_df["Col4"] = 100

In [77]:
pd_df

       Col1      Col2      Col3  Col4
A  0.269696 -1.211775  1.340391   100
B  1.114861 -0.534181  2.319593   100
C -0.212656  1.905034  0.086947   100

In [78]:
pd_df["Col5"] = pd_df["Col1"]+pd_df["Col3"]

In [79]:
pd_df

       Col1      Col2      Col3  Col4      Col5
A  0.269696 -1.211775  1.340391   100  1.610086
B  1.114861 -0.534181  2.319593   100  3.434454
C -0.212656  1.905034  0.086947   100 -0.125709

In [82]:
# Veri Silme: Dikey olarak silme
pd_df_2 = pd_df.drop("Col3",axis=1)

In [83]:
pd_df_2

       Col1      Col2  Col4      Col5
A  0.269696 -1.211775   100  1.610086
B  1.114861 -0.534181   100  3.434454
C -0.212656  1.905034   100 -0.125709

In [84]:
pd_df

       Col1      Col2      Col3  Col4      Col5
A  0.269696 -1.211775  1.340391   100  1.610086
B  1.114861 -0.534181  2.319593   100  3.434454
C -0.212656  1.905034  0.086947   100 -0.125709

In [88]:
# Veri Silme: Dikey olarak silme: inplace yapılan değişikliği kaynak tabloya kaydeder.
pd_df_2 = pd_df.drop("Col3",axis=1,inplace=True)
pd_df_2 = pd_df.drop("Col1",axis=1,inplace=True)

In [89]:
pd_df

       Col2  Col4      Col5
A -1.211775   100  1.610086
B -0.534181   100  3.434454
C  1.905034   100 -0.125709

In [95]:
pd_df.drop("A",axis=0,inplace=True) # A satırını sil
pd_df.drop("B",axis=0,inplace=True) # B satırını sil

In [96]:
pd_df

       Col2  Col4      Col5
C  1.905034   100 -0.125709